Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
              # -- ServiceMonitor will use these tlsConfig settings to make the health check requests
                  tlsConfig: null
                  # -- Prometheus rules will be deployed for alerting purposes
                  prometheusRule:
                    enabled: false
                    additionalLabels: {}
                    # namespace:
                    rules: []
                    #  - alert: PromtailRequestErrors
                    #    expr: 100 * sum(rate(promtail_request_duration_seconds_count{status_code=~"5..|failed"}[1m])) by (namespace, job, route, instance) / sum(rate(promtail_request_duration_seconds_count[1m])) by (namespace, job, route, instance) > 10
                    #    for: 5m
                    #    labels:
                    #      severity: critical
                    #    annotations:
                    #      description: |
                    #        The {{ $labels.job }} {{ $labels.route }} is experiencing
                    #        {{ printf \"%.2f\" $value }} errors.
                    #        VALUE = {{ $value }}
                    #        LABELS = {{ $labels }}
                    #      summary: Promtail request errors (instance {{ $labels.instance }})
                    #  - alert: PromtailRequestLatency
                    #    expr: histogram_quantile(0.99, sum(rate(promtail_request_duration_seconds_bucket[5m])) by (le)) > 1
                    #    for: 5m
                    #    labels:
                    #      severity: critical
                    #    annotations:
                    #      summary: Promtail request latency (instance {{ $labels.instance }})
                    #      description: |
                    #        The {{ $labels.job }} {{ $labels.route }} is experiencing
                    #        {{ printf \"%.2f\" $value }}s 99th percentile latency.
                    #        VALUE = {{ $value }}
                    #        LABELS = {{ $labels }}
                
                # Extra containers created as part of a Promtail Deployment resource
                # - spec for Container:
                #   https://kubernetes.io/docs/reference/generated/kubernetes-api/v1.23/#container-v1-core
                #
                # Note that the key is used as the `name` field, i.e. below will create a
                # container named `promtail-proxy`.
                extraContainers: {}
                  # promtail-proxy:
                  #   image: nginx
                  #   ...
                
                # -- Configure additional ports and services. For each configured port, a corresponding service is created.
                # See values.yaml for details
                extraPorts: {}
                #  syslog:
                #    name: tcp-syslog
                #    annotations: {}
                #    labels: {}
                #    containerPort: 1514
                #    protocol: TCP
                #    service:
                #      type: ClusterIP
                #      clusterIP: null
                #      port: 1514
                #      externalIPs: []
                #      nodePort: null
                #      loadBalancerIP: null
                #      loadBalancerSourceRanges: []
                #      externalTrafficPolicy: null
                #    ingress:
                #      # For Kubernetes >= 1.18 you should specify the ingress-controller via the field ingressClassName
                #      # See https://kubernetes.io/blog/2020/04/02/improvements-to-the-ingress-api-in-kubernetes-1.18/#specifying-the-class-of-an-ingress
                #      # ingressClassName: nginx
                #      # Values can be templated
                #      annotations: {}
                #        # kubernetes.io/ingress.class: nginx
                #        # kubernetes.io/tls-acme: "true"
                #      paths: "/"
                #      hosts:
                #        - chart-example.local
                #
                #      tls: []
                #      #  - secretName: chart-example-tls
                #      #    hosts:
                #      #      - chart-example.local
                
                
                # -- PodSecurityPolicy configuration.
                # @default -- See `values.yaml`
                podSecurityPolicy:
                  privileged: true
                  allowPrivilegeEscalation: true
                  volumes:
                    - 'secret'
                    - 'hostPath'
                    - 'downwardAPI'
                  hostNetwork: false
                  hostIPC: false
                  hostPID: false
                  runAsUser:
                    rule: 'RunAsAny'
                  seLinux:
                    rule: 'RunAsAny'
                  supplementalGroups:
                    rule: 'RunAsAny'
                  fsGroup:
                    rule: 'RunAsAny'
                  readOnlyRootFilesystem: true
                  requiredDropCapabilities:
                    - ALL
                
                # -- Section for crafting Promtails config file. The only directly relevant value is `config.file`
                # which is a templated string that references the other values and snippets below this key.
                # @default -- See `values.yaml`
                config:
                  # -- Enable Promtail config from Helm chart
                  # Set `configmap.enabled: true` and this to `false` to manage your own Promtail config
                  # See default config in `values.yaml`
                  enabled: true
                  # -- The log level of the Promtail server
                  # Must be reference in `config.file` to configure `server.log_level`
                  # See default config in `values.yaml`
                  logLevel: info
                  # -- The log format of the Promtail server
                  # Must be reference in `config.file` to configure `server.log_format`
                  # Valid formats: `logfmt, json`
                  # See default config in `values.yaml`
                  logFormat: logfmt
                  # -- The port of the Promtail server
                  # Must be reference in `config.file` to configure `server.http_listen_port`
                  # See default config in `values.yaml`
                  serverPort: 3101
                  # -- The config of clients of the Promtail server
                  # Must be reference in `config.file` to configure `clients`
                  # @default -- See `values.yaml`
                  clients:
                    - url: http://loki-gateway/loki/api/v1/push
                  # -- Configures where Promtail will save it's positions file, to resume reading after restarts.
                  # Must be referenced in `config.file` to configure `positions`
                  positions:
                    filename: /run/promtail/positions.yaml
                  # -- The config to enable tracing
                  enableTracing: false
                  # -- A section of reusable snippets that can be reference in `config.file`.
                  # Custom snippets may be added in order to reduce redundancy.
                  # This is especially helpful when multiple `kubernetes_sd_configs` are use which usually have large parts in common.
                  # @default -- See `values.yaml`
                  snippets:
                    pipelineStages:
                      - cri: {}
                    common:
                      - action: replace
                        source_labels:
                          - __meta_kubernetes_pod_node_name
                        target_label: node_name
                      - action: replace
                        source_labels:
                          - __meta_kubernetes_namespace
                        target_label: namespace
                      - action: replace
                        replacement: $1
                        separator: /
                        source_labels:
                          - namespace
                          - app
                        target_label: job
                      - action: replace
                        source_labels:
                          - __meta_kubernetes_pod_name
                        target_label: pod
                      - action: replace
                        source_labels:
                          - __meta_kubernetes_pod_container_name
                        target_label: container
                      - action: replace
                        replacement: /var/log/pods/*$1/*.log
                        separator: /
                        source_labels:
                          - __meta_kubernetes_pod_uid
                          - __meta_kubernetes_pod_container_name
                        target_label: __path__
                      - action: replace
                        replacement: /var/log/pods/*$1/*.log
                        regex: true/(.*)
                        separator: /
                        source_labels:
                          - __meta_kubernetes_pod_annotationpresent_kubernetes_io_config_hash
                          - __meta_kubernetes_pod_annotation_kubernetes_io_config_hash
                          - __meta_kubernetes_pod_container_name
                        target_label: __path__
                
                    # If set to true, adds an additional label for the scrape job.
                    # This helps debug the Promtail config.
                    addScrapeJobLabel: false
                
                    # -- You can put here any keys that will be directly added to the config file's 'limits_config' block.
                    # @default -- empty
                    extraLimitsConfig: ""
                
                    # -- You can put here any keys that will be directly added to the config file's 'server' block.
                    # @default -- empty
                    extraServerConfigs: ""
                
                    # -- You can put here any additional scrape configs you want to add to the config file.
                    # @default -- empty
                    extraScrapeConfigs: ""
                
                    # -- You can put here any additional relabel_configs to "kubernetes-pods" job
                    extraRelabelConfigs: []
                
                    scrapeConfigs: |
                      # See also https://github.com/grafana/loki/blob/master/production/ksonnet/promtail/scrape_config.libsonnet for reference
                      - job_name: kubernetes-pods
                        pipeline_stages:
                          {{- toYaml .Values.config.snippets.pipelineStages | nindent 4 }}
                        kubernetes_sd_configs:
                          - role: pod
                        relabel_configs:
                          - source_labels:
                              - __meta_kubernetes_pod_controller_name
                            regex: ([0-9a-z-.]+?)(-[0-9a-f]{8,10})?
                            action: replace
                            target_label: __tmp_controller_name
                          - source_labels:
                              - __meta_kubernetes_pod_label_app_kubernetes_io_name
                              - __meta_kubernetes_pod_label_app
                              - __tmp_controller_name
                              - __meta_kubernetes_pod_name
                            regex: ^;*([^;]+)(;.*)?$
                            action: replace
                            target_label: app
                          - source_labels:
                              - __meta_kubernetes_pod_label_app_kubernetes_io_instance
                              - __meta_kubernetes_pod_label_instance
                            regex: ^;*([^;]+)(;.*)?$
                            action: replace
                            target_label: instance
                          - source_labels:
                              - __meta_kubernetes_pod_label_app_kubernetes_io_component
                              - __meta_kubernetes_pod_label_component
                            regex: ^;*([^;]+)(;.*)?$
                            action: replace
                            target_label: component
                          {{- if .Values.config.snippets.addScrapeJobLabel }}
                          - replacement: kubernetes-pods
                            target_label: scrape_job
                          {{- end }}
                          {{- toYaml .Values.config.snippets.common | nindent 4 }}
                          {{- with .Values.config.snippets.extraRelabelConfigs }}
                          {{- toYaml . | nindent 4 }}
                          {{- end }}
                
                  # -- Config file contents for Promtail.
                  # Must be configured as string.
                  # It is templated so it can be assembled from reusable snippets in order to avoid redundancy.
                  # @default -- See `values.yaml`
                  file: |
                    server:
                      log_level: {{ .Values.config.logLevel }}
                      log_format: {{ .Values.config.logFormat }}
                      http_listen_port: {{ .Values.config.serverPort }}
                      {{- with .Values.httpPathPrefix }}
                      http_path_prefix: {{ . }}
                      {{- end }}
                      {{- tpl .Values.config.snippets.extraServerConfigs . | nindent 2 }}
                
                    clients:
                      {{- tpl (toYaml .Values.config.clients) . | nindent 2 }}
                
                    positions:
                      {{- tpl (toYaml .Values.config.positions) . | nindent 2 }}
                
                    scrape_configs:
                      {{- tpl .Values.config.snippets.scrapeConfigs . | nindent 2 }}
                      {{- tpl .Values.config.snippets.extraScrapeConfigs . | nindent 2 }}
                
                    limits_config:
                      {{- tpl .Values.config.snippets.extraLimitsConfig . | nindent 2 }}
                
                    tracing:
                      enabled: {{ .Values.config.enableTracing }}
                
                networkPolicy:
                  # -- Specifies whether Network Policies should be created
                  enabled: false
                  metrics:
                    # -- Specifies the Pods which are allowed to access the metrics port.
                    # As this is cross-namespace communication, you also neeed the namespaceSelector.
                    podSelector: {}
                    # -- Specifies the namespaces which are allowed to access the metrics port
                    namespaceSelector: {}
                    # -- Specifies specific network CIDRs which are allowed to access the metrics port.
                    # In case you use namespaceSelector, you also have to specify your kubelet networks here.
                    # The metrics ports are also used for probes.
                    cidrs: []
                  k8sApi:
                    # -- Specify the k8s API endpoint port
                    port: 8443
                    # -- Specifies specific network CIDRs you want to limit access to
                    cidrs: []
                
                # -- Base path to server all API routes fro
                httpPathPrefix: ""
                
                sidecar:
                  configReloader:
                    enabled: false
                    image:
                      # -- The Docker registry for sidecar config-reloader
                      registry: ghcr.io
                      # -- Docker image repository for sidecar config-reloader
                      repository: jimmidyson/configmap-reload
                      # -- Docker image tag for sidecar config-reloader
                      tag: v0.12.0
                      # -- Docker image pull policy for sidecar config-reloader
                      pullPolicy: IfNotPresent
                    # Extra args for the config-reloader container.
                    extraArgs: []
                    # -- Extra environment variables for sidecar config-reloader
                    extraEnv: []
                    # -- Extra environment variables from secrets or configmaps for sidecar config-reloader
                    extraEnvFrom: []
                    # -- The security context for containers for sidecar config-reloader
                    containerSecurityContext:
                      readOnlyRootFilesystem: true
                      capabilities:
                        drop:
                          - ALL
                      allowPrivilegeEscalation: false
                    # -- Readiness probe for sidecar config-reloader
                    readinessProbe: {}
                    # -- Liveness probe for sidecar config-reloader
                    livenessProbe: {}
                    # -- Resource requests and limits for sidecar config-reloader
                    resources: {}
                    #  limits:
                    #    cpu: 200m
                    #    memory: 128Mi
                    #  requests:
                    #    cpu: 100m
                    #    memory: 128Mi
                    config:
                      # -- The port of the config-reloader server
                      serverPort: 9533
                    serviceMonitor:
                      enabled: true
                
                # -- Extra K8s manifests to deploy
                extraObjects: []
                  # - apiVersion: "kubernetes-client.io/v1"
                  #   kind: ExternalSecret
                  #   metadata:
                  #     name: promtail-secrets
                  #   spec:
                  #     backendType: gcpSecretsManager
                  #     data:
                  #       - key: promtail-oauth2-creds
                  #         name: client_secret
            EOT,
        ] -> null
      - verify                     = false -> null
      - version                    = "6.16.6" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # module.loki-stack.kubernetes_secret.loki_sa_secret will be destroyed
  # (because kubernetes_secret.loki_sa_secret is not in configuration)
- resource "kubernetes_secret" "loki_sa_secret" {
      - data                           = (sensitive value) -> null
      - id                             = "monitoring/loki-sa-key" -> null
      - immutable                      = false -> null
      - type                           = "Opaque" -> null
      - wait_for_service_account_token = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "loki-sa-key" -> null
          - namespace        = "monitoring" -> null
          - resource_version = "14569918" -> null
          - uid              = "0f95c418-48fe-4634-8690-dd49e4314043" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.monitoring.helm_release.prometheus will be created
+ resource "helm_release" "prometheus" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "68.4.5"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.monitoring.kubernetes_manifest.grafana-gateway will be created
+ resource "kubernetes_manifest" "grafana-gateway" {
      + manifest = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + name      = "grafana-vs"
              + namespace = "monitoring"
            }
          + spec       = {
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "grafana.goboolean.io",
                ]
              + http     = [
                  + {
                      + route = [
                          + {
                              + destination = {
                                  + host = "prometheus-grafana.monitoring.svc.cluster.local"
                                  + port = {
                                      + number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
      + object   = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "grafana-vs"
              + namespace                  = "monitoring"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + exportTo = (known after apply)
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "grafana.goboolean.io",
                ]
              + http     = [
                  + {
                      + corsPolicy       = {
                          + allowCredentials    = (known after apply)
                          + allowHeaders        = (known after apply)
                          + allowMethods        = (known after apply)
                          + allowOrigin         = (known after apply)
                          + allowOrigins        = (known after apply)
                          + exposeHeaders       = (known after apply)
                          + maxAge              = (known after apply)
                          + unmatchedPreflights = (known after apply)
                        }
                      + delegate         = {
                          + name      = (known after apply)
                          + namespace = (known after apply)
                        }
                      + directResponse   = {
                          + body   = {
                              + bytes  = (known after apply)
                              + string = (known after apply)
                            }
                          + status = (known after apply)
                        }
                      + fault            = {
                          + abort = {
                              + grpcStatus = (known after apply)
                              + http2Error = (known after apply)
                              + httpStatus = (known after apply)
                              + percentage = {
                                  + value = (known after apply)
                                }
                            }
                          + delay = {
                              + exponentialDelay = (known after apply)
                              + fixedDelay       = (known after apply)
                              + percent          = (known after apply)
                              + percentage       = {
                                  + value = (known after apply)
                                }
                            }
                        }
                      + headers          = {
                          + request  = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                          + response = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                        }
                      + match            = (known after apply)
                      + mirror           = {
                          + host   = (known after apply)
                          + port   = {
                              + number = (known after apply)
                            }
                          + subset = (known after apply)
                        }
                      + mirrorPercent    = (known after apply)
                      + mirrorPercentage = {
                          + value = (known after apply)
                        }
                      + mirror_percent   = (known after apply)
                      + mirrors          = (known after apply)
                      + name             = (known after apply)
                      + redirect         = {
                          + authority    = (known after apply)
                          + derivePort   = (known after apply)
                          + port         = (known after apply)
                          + redirectCode = (known after apply)
                          + scheme       = (known after apply)
                          + uri          = (known after apply)
                        }
                      + retries          = {
                          + attempts              = (known after apply)
                          + perTryTimeout         = (known after apply)
                          + retryOn               = (known after apply)
                          + retryRemoteLocalities = (known after apply)
                        }
                      + rewrite          = {
                          + authority       = (known after apply)
                          + uri             = (known after apply)
                          + uriRegexRewrite = {
                              + match   = (known after apply)
                              + rewrite = (known after apply)
                            }
                        }
                      + route            = [
                          + {
                              + destination = {
                                  + host   = "prometheus-grafana.monitoring.svc.cluster.local"
                                  + port   = {
                                      + number = 80
                                    }
                                  + subset = (known after apply)
                                }
                              + headers     = {
                                  + request  = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                  + response = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                }
                              + weight      = (known after apply)
                            },
                        ]
                      + timeout          = (known after apply)
                    },
                ]
              + tcp      = (known after apply)
              + tls      = (known after apply)
            }
        }
    }

  # module.monitoring.kubernetes_manifest.prometheus-gateway will be created
+ resource "kubernetes_manifest" "prometheus-gateway" {
      + manifest = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + name      = "prometheus-vs"
              + namespace = "monitoring"
            }
          + spec       = {
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "prometheus.goboolean.io",
                ]
              + http     = [
                  + {
                      + route = [
                          + {
                              + destination = {
                                  + host = "prometheus-kube-prometheus-prometheus.monitoring.svc.cluster.local"
                                  + port = {
                                      + number = 9090
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
      + object   = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "prometheus-vs"
              + namespace                  = "monitoring"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + exportTo = (known after apply)
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "prometheus.goboolean.io",
                ]
              + http     = [
                  + {
                      + corsPolicy       = {
                          + allowCredentials    = (known after apply)
                          + allowHeaders        = (known after apply)
                          + allowMethods        = (known after apply)
                          + allowOrigin         = (known after apply)
                          + allowOrigins        = (known after apply)
                          + exposeHeaders       = (known after apply)
                          + maxAge              = (known after apply)
                          + unmatchedPreflights = (known after apply)
                        }
                      + delegate         = {
                          + name      = (known after apply)
                          + namespace = (known after apply)
                        }
                      + directResponse   = {
                          + body   = {
                              + bytes  = (known after apply)
                              + string = (known after apply)
                            }
                          + status = (known after apply)
                        }
                      + fault            = {
                          + abort = {
                              + grpcStatus = (known after apply)
                              + http2Error = (known after apply)
                              + httpStatus = (known after apply)
                              + percentage = {
                                  + value = (known after apply)
                                }
                            }
                          + delay = {
                              + exponentialDelay = (known after apply)
                              + fixedDelay       = (known after apply)
                              + percent          = (known after apply)
                              + percentage       = {
                                  + value = (known after apply)
                                }
                            }
                        }
                      + headers          = {
                          + request  = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                          + response = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                        }
                      + match            = (known after apply)
                      + mirror           = {
                          + host   = (known after apply)
                          + port   = {
                              + number = (known after apply)
                            }
                          + subset = (known after apply)
                        }
                      + mirrorPercent    = (known after apply)
                      + mirrorPercentage = {
                          + value = (known after apply)
                        }
                      + mirror_percent   = (known after apply)
                      + mirrors          = (known after apply)
                      + name             = (known after apply)
                      + redirect         = {
                          + authority    = (known after apply)
                          + derivePort   = (known after apply)
                          + port         = (known after apply)
                          + redirectCode = (known after apply)
                          + scheme       = (known after apply)
                          + uri          = (known after apply)
                        }
                      + retries          = {
                          + attempts              = (known after apply)
                          + perTryTimeout         = (known after apply)
                          + retryOn               = (known after apply)
                          + retryRemoteLocalities = (known after apply)
                        }
                      + rewrite          = {
                          + authority       = (known after apply)
                          + uri             = (known after apply)
                          + uriRegexRewrite = {
                              + match   = (known after apply)
                              + rewrite = (known after apply)
                            }
                        }
                      + route            = [
                          + {
                              + destination = {
                                  + host   = "prometheus-kube-prometheus-prometheus.monitoring.svc.cluster.local"
                                  + port   = {
                                      + number = 9090
                                    }
                                  + subset = (known after apply)
                                }
                              + headers     = {
                                  + request  = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                  + response = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                }
                              + weight      = (known after apply)
                            },
                        ]
                      + timeout          = (known after apply)
                    },
                ]
              + tcp      = (known after apply)
              + tls      = (known after apply)
            }
        }
    }

Plan: 3 to add, 1 to change, 9 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 3 to add, 1 to change, 9 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
